# чтение из csv файла данных и расчет балки
import os, fnmatch, csv
import string_calculation

def read_file(a):
    a = str(a)
    l=[]
    with open(a,'r',newline='') as file:
        reader = csv.reader(file)
        for row in reader:
            l = l + [row]
    return tabl_taxt(l)

def tabl_taxt(tabl):
    text_file = ''
    for i in tabl:
        text_file += i[0] + '\t' + i[1] + i[2] + '\n'
    return text_file

def calculation(name, text_file):
    txt = string_calculation.Calc()
    t = text_file
    # поиск и замена с помощью регулярных выражений
    t='''Определение расчетного сопротивление под подошвой фундамента
расчет по СП 22.13330.2011 ОСНОВАНИЯ ЗДАНИЙ И СООРУЖЕНИЙ
Исходные данные:
'''+t
    #txt.c1(t,60)
    t0='''Коэффициенты определенные по таблице 5.4. СП
g_c1=1.1
g_c2=1
Коэффициенты принимаемые по таблице 5.5 СП
m_y=0.36
m_g=2.43
m_o=4.99
Коэффициент принимаемый равным 1 при ширине фундамента меньше 10 м:
k_s=1
'''
    import re
    find_angle = re.search('arphi=\d\d', t).group()
    # txt_inp = t.split('\n')[7]#извлечение строки из текста
    # z = txt_inp
    txt_inp = int(find_angle.split('=')[1])#извлечение нужной части строки
    K1 = {0: 0, 1: 0.01, 2: 0.03, 3: 0.04, 4: 0.06, 5: 0.08, 6: 0.1, 7: 0.12, 8: 0.14, 9: 0.16, 10: 0.18, 11: 0.21, 12: 0.23, 13: 0.26, 14: 0.29, 15: 0.32, 16: 0.36, 17: 0.39, 18: 0.43, 19: 0.47, 20: 0.51, 21: 0.56, 22: 0.61, 23: 0.66, 24: 0.72, 25: 0.78, 26: 0.84, 27: 0.91, 28: 0.98, 29: 1.06, 30: 1.15, 31: 1.24, 32: 1.34, 33: 1.44, 34: 1.55, 35: 1.68, 36: 1.81, 37: 1.95, 38: 2.11, 39: 2.28, 40: 2.46, 41: 2.66, 42: 2.88, 43: 3.12, 44: 3.38, 45: 3.66}
    K2 = {0: 1.0, 1: 1.06, 2: 1.12, 3: 1.18, 4: 1.25, 5: 1.32, 6: 1.39, 7: 1.47, 8: 1.55, 9: 1.64, 10: 1.73, 11: 1.83, 12: 1.94, 13: 2.05, 14: 2.17, 15: 2.3, 16: 2.43, 17: 2.57, 18: 2.73, 19: 2.89, 20: 3.06, 21: 3.24, 22: 3.44, 23: 3.65, 24: 3.87, 25: 4.11, 26: 4.37, 27: 4.64, 28: 4.93, 29: 5.25, 30: 5.59, 31: 5.95, 32: 6.34, 33: 6.76, 34: 7.22, 35: 7.71, 36: 8.24, 37: 8.81, 38: 9.44, 39: 10.11, 40: 10.85, 41: 11.64, 42: 12.51, 43: 13.46, 44: 14.5, 45: 15.64}
    K3 = {0: 3.14, 1: 3.14, 2: 3.32, 3: 3.41, 4: 3.51, 5: 3.61, 6: 3.71, 7: 3.82, 8: 3.93, 9: 4.05, 10: 4.17, 11: 4.29, 12: 4.42, 13: 4.55, 14: 4.69, 15: 4.84, 16: 4.99, 17: 5.15, 18: 5.31, 19: 5.48, 20: 5.66, 21: 5.84, 22: 6.04, 23: 6.24, 24: 6.45, 25: 6.67, 26: 6.9, 27: 7.14, 28: 7.4, 29: 7.67, 30: 7.95, 31: 8.24, 32: 8.55, 33: 8.88, 34: 9.22, 35: 9.58, 36: 9.97, 37: 10.37, 38: 10.8, 39: 11.25, 40: 11.73, 41: 12.24, 42: 12.79, 43: 13.37, 44: 13.98, 45: 14.64}

    t0 = t0.replace('m_y=0.36','m_y='+ str(K1[txt_inp]))
    t0 = t0.replace('m_g=2.43','m_g='+ str(K2[txt_inp]))
    t0 = t0.replace('m_o=4.99','m_o='+ str(K3[txt_inp]))
    t = t + t0
    txt.c1(text = t, n_letter = 50, charge = '\t')
    t = '''Допустимые напряжения составят (тс/м^2):
R_f=(g_c1*g_c2)/k_0*(m_y*k_s*B_f*G_2+m_g*d_1*G_1+(m_g-1)*d_b*G_2+m_o*c_2*100)
Давление под подошвой фундамента (тс/м^2):
P_r=P_0/(B_f*L_f)*1/10**3
Коэффициент использования составит:
k_1=P_r/R_f'''

    txt.c1(t)
    p = txt.finish(name = name)
    print(p)
    text_file = txt.rezult
    return text_file

def main():
    # отбор нужных файлов
    f = []# создание списка файлов и чтение из текущей папки списка файлов
    for file in os.listdir('.'):
        if fnmatch.fnmatch(file, '*BRG.csv'):
            f += [file]
    for i in f:
        text_file = read_file(i)
        name = i[:-7]
        text_file = calculation(name, text_file)
        print(text_file)
    pass

if __name__ == '__main__':
    main()
    
def BRG(name, tabl):
    text_file = tabl_taxt(tabl)
    text_file = calculation(name, text_file)
    return text_file